# Используем официальный образ Node.js
FROM node:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем зависимости и файл package.json
COPY package.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы проекта внутрь контейнера
COPY . .

# Собираем проект
RUN npm run build

# Задаем переменную окружения для указания порта
ENV PORT 3000

# Открываем порт 3000 для внешнего доступа
EXPOSE 3000

# Команда для запуска приложения при старте контейнера
CMD ["npm", "start"]


